import { Product, User } from '@/entities'

export const users: User[] = [
  {
    "id": 1,
    "name": "Айгерим",
    "status": "Зарплатный клиент",
    "age": 29,
    "city": "Алматы",
    "avg_monthly_balance_KZT": 92643
  },
  {
    "id": 2,
    "name": "Данияр",
    "status": "Премиальный клиент",
    "age": 41,
    "city": "Астана",
    "avg_monthly_balance_KZT": 1577073
  },
  {
    "id": 3,
    "name": "Сабина",
    "status": "Студент",
    "age": 22,
    "city": "Алматы",
    "avg_monthly_balance_KZT": 63116
  },
  {
    "id": 4,
    "name": "Тимур",
    "status": "Зарплатный клиент",
    "age": 36,
    "city": "Караганда",
    "avg_monthly_balance_KZT": 83351
  },
  {
    "id": 5,
    "name": "Камилла",
    "status": "Премиальный клиент",
    "age": 45,
    "city": "Алматы",
    "avg_monthly_balance_KZT": 1336536
  },
  {
    "id": 6,
    "name": "Аян",
    "status": "Стандартный клиент",
    "age": 34,
    "city": "Шымкент",
    "avg_monthly_balance_KZT": 131929
  },
  {
    "id": 7,
    "name": "Руслан",
    "status": "Премиальный клиент",
    "age": 48,
    "city": "Алматы",
    "avg_monthly_balance_KZT": 4040997
  },
  {
    "id": 8,
    "name": "Мадина",
    "status": "Зарплатный клиент",
    "age": 33,
    "city": "Астана",
    "avg_monthly_balance_KZT": 1058403
  },
  {
    "id": 9,
    "name": "Арман",
    "status": "Премиальный клиент",
    "age": 55,
    "city": "Алматы",
    "avg_monthly_balance_KZT": 3084180
  },
  {
    "id": 10,
    "name": "Карина",
    "status": "Зарплатный клиент",
    "age": 38,
    "city": "Усть-Каменогорск",
    "avg_monthly_balance_KZT": 1277325
  },
  {
    "id": 11,
    "name": "Бауржан",
    "status": "Премиальный клиент",
    "age": 50,
    "city": "Павлодар",
    "avg_monthly_balance_KZT": 3230572
  },
  {
    "id": 12,
    "name": "Жанар",
    "status": "Зарплатный клиент",
    "age": 42,
    "city": "Костанай",
    "avg_monthly_balance_KZT": 849046
  },
  {
    "id": 13,
    "name": "Алина",
    "status": "Студент",
    "age": 20,
    "city": "Алматы",
    "avg_monthly_balance_KZT": 54074
  },
  {
    "id": 14,
    "name": "Диас",
    "status": "Зарплатный клиент",
    "age": 27,
    "city": "Астана",
    "avg_monthly_balance_KZT": 57385
  },
  {
    "id": 15,
    "name": "Нурия",
    "status": "Стандартный клиент",
    "age": 31,
    "city": "Шымкент",
    "avg_monthly_balance_KZT": 160778
  },
  {
    "id": 16,
    "name": "Ерасыл",
    "status": "Студент",
    "age": 23,
    "city": "Караганда",
    "avg_monthly_balance_KZT": 46630
  },
  {
    "id": 17,
    "name": "Жанель",
    "status": "Зарплатный клиент",
    "age": 30,
    "city": "Тараз",
    "avg_monthly_balance_KZT": 89126
  },
  {
    "id": 18,
    "name": "Санжар",
    "status": "Стандартный клиент",
    "age": 35,
    "city": "Кызылорда",
    "avg_monthly_balance_KZT": 98089
  },
  {
    "id": 19,
    "name": "Азамат",
    "status": "Зарплатный клиент",
    "age": 32,
    "city": "Алматы",
    "avg_monthly_balance_KZT": 80150
  },
  {
    "id": 20,
    "name": "Анель",
    "status": "Стандартный клиент",
    "age": 28,
    "city": "Астана",
    "avg_monthly_balance_KZT": 141515
  },
  {
    "id": 21,
    "name": "Павел",
    "status": "Премиальный клиент",
    "age": 44,
    "city": "Алматы",
    "avg_monthly_balance_KZT": 1798169
  },
  {
    "id": 22,
    "name": "Аружан",
    "status": "Зарплатный клиент",
    "age": 26,
    "city": "Шымкент",
    "avg_monthly_balance_KZT": 77474
  },
  {
    "id": 23,
    "name": "Темирлан",
    "status": "Стандартный клиент",
    "age": 39,
    "city": "Павлодар",
    "avg_monthly_balance_KZT": 146389
  },
  {
    "id": 24,
    "name": "Гульмира",
    "status": "Зарплатный клиент",
    "age": 41,
    "city": "Усть-Каменогорск",
    "avg_monthly_balance_KZT": 53785
  },
  {
    "id": 25,
    "name": "Адиль",
    "status": "Зарплатный клиент",
    "age": 36,
    "city": "Алматы",
    "avg_monthly_balance_KZT": 55634
  },
  {
    "id": 26,
    "name": "Маржан",
    "status": "Стандартный клиент",
    "age": 33,
    "city": "Астана",
    "avg_monthly_balance_KZT": 136248
  },
  {
    "id": 27,
    "name": "Нурсултан",
    "status": "Зарплатный клиент",
    "age": 29,
    "city": "Караганда",
    "avg_monthly_balance_KZT": 70858
  },
  {
    "id": 28,
    "name": "Алтынай",
    "status": "Стандартный клиент",
    "age": 42,
    "city": "Кызылорда",
    "avg_monthly_balance_KZT": 150281
  },
  {
    "id": 29,
    "name": "Сая",
    "status": "Зарплатный клиент",
    "age": 25,
    "city": "Тараз",
    "avg_monthly_balance_KZT": 88487
  },
  {
    "id": 30,
    "name": "Ербол",
    "status": "Стандартный клиент",
    "age": 40,
    "city": "Павлодар",
    "avg_monthly_balance_KZT": 104553
  },
  {
    "id": 31,
    "name": "Дамир",
    "status": "Зарплатный клиент",
    "age": 34,
    "city": "Алматы",
    "avg_monthly_balance_KZT": 1303848
  },
  {
    "id": 32,
    "name": "Алия",
    "status": "Премиальный клиент",
    "age": 46,
    "city": "Астана",
    "avg_monthly_balance_KZT": 2317160
  },
  {
    "id": 33,
    "name": "Мерей",
    "status": "Зарплатный клиент",
    "age": 31,
    "city": "Шымкент",
    "avg_monthly_balance_KZT": 824246
  },
  {
    "id": 34,
    "name": "Инкар",
    "status": "Стандартный клиент",
    "age": 37,
    "city": "Караганда",
    "avg_monthly_balance_KZT": 115930
  },
  {
    "id": 35,
    "name": "Самат",
    "status": "Премиальный клиент",
    "age": 52,
    "city": "Алматы",
    "avg_monthly_balance_KZT": 1448797
  },
  {
    "id": 36,
    "name": "Назым",
    "status": "Зарплатный клиент",
    "age": 29,
    "city": "Усть-Каменогорск",
    "avg_monthly_balance_KZT": 712277
  },
  {
    "id": 37,
    "name": "Гульнар",
    "status": "Зарплатный клиент",
    "age": 45,
    "city": "Алматы",
    "avg_monthly_balance_KZT": 900361
  },
  {
    "id": 38,
    "name": "Серик",
    "status": "Премиальный клиент",
    "age": 54,
    "city": "Астана",
    "avg_monthly_balance_KZT": 5818675
  },
  {
    "id": 39,
    "name": "Ляззат",
    "status": "Зарплатный клиент",
    "age": 39,
    "city": "Костанай",
    "avg_monthly_balance_KZT": 1248239
  },
  {
    "id": 40,
    "name": "Асхат",
    "status": "Стандартный клиент",
    "age": 43,
    "city": "Павлодар",
    "avg_monthly_balance_KZT": 86092
  },
  {
    "id": 41,
    "name": "Сандугаш",
    "status": "Зарплатный клиент",
    "age": 47,
    "city": "Шымкент",
    "avg_monthly_balance_KZT": 1164313
  },
  {
    "id": 42,
    "name": "Рустем",
    "status": "Премиальный клиент",
    "age": 58,
    "city": "Алматы",
    "avg_monthly_balance_KZT": 2948028
  },
  {
    "id": 43,
    "name": "Нуртас",
    "status": "Зарплатный клиент",
    "age": 28,
    "city": "Астана",
    "avg_monthly_balance_KZT": 76320
  },
  {
    "id": 44,
    "name": "Айнагуль",
    "status": "Стандартный клиент",
    "age": 35,
    "city": "Алматы",
    "avg_monthly_balance_KZT": 89846
  },
  {
    "id": 45,
    "name": "Диана",
    "status": "Зарплатный клиент",
    "age": 27,
    "city": "Караганда",
    "avg_monthly_balance_KZT": 72552
  },
  {
    "id": 46,
    "name": "Арсен",
    "status": "Стандартный клиент",
    "age": 33,
    "city": "Кызылорда",
    "avg_monthly_balance_KZT": 86024
  },
  {
    "id": 47,
    "name": "Камшат",
    "status": "Зарплатный клиент",
    "age": 30,
    "city": "Тараз",
    "avg_monthly_balance_KZT": 79592
  },
  {
    "id": 48,
    "name": "Ержан",
    "status": "Стандартный клиент",
    "age": 38,
    "city": "Павлодар",
    "avg_monthly_balance_KZT": 82214
  },
  {
    "id": 49,
    "name": "Амина",
    "status": "Зарплатный клиент",
    "age": 26,
    "city": "Алматы",
    "avg_monthly_balance_KZT": 1410759
  },
  {
    "id": 50,
    "name": "Тимурлан",
    "status": "Премиальный клиент",
    "age": 42,
    "city": "Астана",
    "avg_monthly_balance_KZT": 3573697
  },
  {
    "id": 51,
    "name": "Жанат",
    "status": "Зарплатный клиент",
    "age": 31,
    "city": "Шымкент",
    "avg_monthly_balance_KZT": 1429027
  },
  {
    "id": 52,
    "name": "Милана",
    "status": "Премиальный клиент",
    "age": 36,
    "city": "Алматы",
    "avg_monthly_balance_KZT": 3418709
  },
  {
    "id": 53,
    "name": "Расул",
    "status": "Зарплатный клиент",
    "age": 29,
    "city": "Караганда",
    "avg_monthly_balance_KZT": 1258584
  },
  {
    "id": 54,
    "name": "Виктория",
    "status": "Премиальный клиент",
    "age": 45,
    "city": "Усть-Каменогорск",
    "avg_monthly_balance_KZT": 4083294
  },
  {
    "id": 55,
    "name": "Асель",
    "status": "Премиальный клиент",
    "age": 49,
    "city": "Алматы",
    "avg_monthly_balance_KZT": 3504443
  },
  {
    "id": 56,
    "name": "Нуркен",
    "status": "Зарплатный клиент",
    "age": 44,
    "city": "Астана",
    "avg_monthly_balance_KZT": 60622
  },
  {
    "id": 57,
    "name": "Жания",
    "status": "Премиальный клиент",
    "age": 52,
    "city": "Павлодар",
    "avg_monthly_balance_KZT": 2757704
  },
  {
    "id": 58,
    "name": "Султан",
    "status": "Зарплатный клиент",
    "age": 40,
    "city": "Караганда",
    "avg_monthly_balance_KZT": 62335
  },
  {
    "id": 59,
    "name": "Динара",
    "status": "Премиальный клиент",
    "age": 55,
    "city": "Алматы",
    "avg_monthly_balance_KZT": 4427461
  },
  {
    "id": 60,
    "name": "Ермек",
    "status": "Зарплатный клиент",
    "age": 42,
    "city": "Кызылорда",
    "avg_monthly_balance_KZT": 48779
  }
]


export const products: Product[] = [
  {
    "id": 1,
    "name": "Карта для путешествий",
    "features": [
      "4% кешбэк на категорию «Путешествия», такси, поезда, самолеты",
      "Привилегии Visa Signature",
      "Скидки/кешбэк за авиабилеты, отели, аренду авто"
    ],
    "target_audience": "Часто находится в движении и бронирующим отели"
  },
  {
    "id": 2,
    "name": "Премиальная карта",
    "features": [
      "Кешбэк: 2% базовый; 3% при депозите 1–6 млн ₸; 4% при депозите от 6 млн ₸",
      "Лимит кешбэка — 100 000 ₸/мес",
      "Повышенный кешбэк 4% на ювелирные изделия, парфюмерию и рестораны",
      "Наличные по миру бесплатно до 3 млн ₸/мес",
      "Переводы на карты РК — бесплатно"
    ],
    "target_audience": "Тем, кто держит крупный остаток/депозит и часто снимает/переводит"
  },
  {
    "id": 3,
    "name": "Кредитная карта",
    "features": [
      "Кредитный лимит: до 2 000 000 ₸ на 2 месяца без переплаты",
      "Кешбэк до 10% в трёх любимых категориях, выбираемых каждый месяц",
      "10% кешбэк на онлайн-услуги (игры, доставка, кино)",
      "Рассрочка 3–24 мес. без переплат"
    ],
    "target_audience": "Тем, кто оптимизирует траты и использует рассрочку/кредит"
  },
  {
    "id": 4,
    "name": "Обмен валют",
    "features": [
      "Выгодный курс в приложении, без комиссии, 24/7",
      "Моментальные операции",
      "Возможность выставить целевой курс и авто-покупка"
    ],
    "target_audience": "Тем, кто часто меняет валюту и хочет ловить курс"
  },
  {
    "id": 5,
    "name": "Кредит наличными",
    "features": [
      "Без залога/справок/цели",
      "Оформление онлайн или в отделении",
      "Достаточно удостоверения личности (+ согласие супруга/и при необходимости)",
      "Досрочное/частичное погашение без штрафов",
      "Возможна отсрочка платежа",
      "Ставка: 12% на 1 год; свыше 1 года — 21%"
    ],
    "target_audience": "Для быстрого финансирования без обеспечения"
  },
  {
    "id": 6,
    "name": "Депозит Мультивалютный",
    "features": [
      "Ставка: 14,50%",
      "Пополнение и снятие без ограничений",
      "Валюта: KZT/USD/RUB/EUR"
    ],
    "target_audience": "Хранить/ребалансировать валюты с доступом к деньгам"
  },
  {
    "id": 7,
    "name": "Депозит Сберегательный",
    "features": [
      "Ставка: 16,50%",
      "Пополнение — нет",
      "Снятие — нет (до конца срока)",
      "Защита KDIF"
    ],
    "target_audience": "Максимальный доход при готовности «заморозить» средства"
  },
  {
    "id": 8,
    "name": "Депозит Накопительный",
    "features": [
      "Ставка: 15,50%",
      "Пополнение — да",
      "Снятие — нет"
    ],
    "target_audience": "Планомерно откладывать под повышенную ставку"
  },
  {
    "id": 9,
    "name": "Инвестиции",
    "features": [
      "Комиссии: 0% на сделки",
      "Пополнение/вывод без комиссий в первый год",
      "Порог входа от 6 ₸"
    ],
    "target_audience": "Стартовать с малых сумм и без издержек"
  },
  {
    "id": 10,
    "name": "Золотые слитки",
    "features": [
      "Покупка/продажа в отделениях",
      "Предзаказ в приложении",
      "Слитки 999,9 пробы разных весов",
      "Возможность хранения в сейфовых ячейках банка"
    ],
    "target_audience": "Диверсификация и долгосрочное сохранение стоимости"
  }
]
